/**
 * An object representing various error codes and their corresponding error messages.
 * The keys are error codes, and the values are the corresponding error messages.
 */

const ERROR = {
    '0': 'Ok',
    '-1': 'Виконання неуспішне',
    '-2': 'Помилка валідації параметра',
    '-3': 'Невідомий термінал',
    '-4': 'Помилка vend(Необхідно додатково уточнити статус)',
    '-5': 'Надто малий баланс',
    '-7': 'Помилка vend(Вся сума зарахована на бонусний рахунок)',
    '-10': 'Система зайнята, спробуйте пізніше',
    '-11': 'Помилка під’єднання до термінала',
    '-12': 'Термінал зайнятий',
    '-13': 'Не введені персональні дані або не підтверджено email',
    '-14': 'email був підтверджений раніше',
    '-15': 'Сесія з терміналом завершена',
    '-16': 'Користувач вже існує (CMD=REGISTER)',
    '-17': 'Невірний логін/пароль',
    '-18': 'Невірний пін-код',
    '-19': 'Немає води для продажу',
    '-20': 'Термінал заборонений',
    '-21': 'Заборонено під’єднуватись до даного термінала',
    '-22': 'ел.пошта не була підтверджена',
    '-23': 'Користувач заблокований',
    '-24': 'Користувач заблокований для даного вендингового об’єкта',
    '-25': 'Партнер не активний (GATE)',
    '-26': 'Дана версія аплікації застаріла. Оновіть аплікацію',
    '-27': 'Вийшов час підтвердження реєстрації',
    '-28': 'Необхідно завершити реєстрацію (CMD=CHANGE_PWD)',
    '-29': 'Перевищено кількість спроб реєстрації на сьогодні (3)',
    '-30': 'Перевищено кількість спроб підтвердження реєстрації (3)',
    '-31': 'Сервіс тимчасово недоступний',
};

// Export the ERROR object so that it can be used in other modules.
export { ERROR };